Repository: offsoc/github
Catalog: data/github/current/config/locales/*/github.po
Languages: ja, pt

source: +3 collaborators
ja: +3協力者
pt: +3 colaboradores

source: 100% to developers, zero fees
ja: 開発者に100%、手数料ゼロ
pt: 100% para desenvolvedores, taxas zero

source: 200+ million
ja: 2億人以上

source: 3+ million
ja: 3+百万

source: 65+ million
ja: 6,500万円以上

source: About
ja: GitHubについて
pt: Sobre

source: Actions
ja: アクション

source: Add your favorite VS Code extensions, create a devcontainer config file, install new themes, and tweak your settings.
ja: お気に入りのVSコード拡張子を追加し、devcontainerの設定ファイルを作成し、新しいテーマをインストールし、設定を微調整します。
pt: Adicione suas extensões favoritas do VS Code, crie um arquivo de configuração devcontainer, instale novos temas e ajuste suas configurações.

source: Added package for javascript linting
ja: JavaScriptのlinting用パッケージを追加しました
pt: Pacote javascript adicionado para lint

source: Amplify your voice in your own personal README on your profile.
ja: あなたのプロフィール上のあなた自身の個人的なREADMEであなたの声を増幅します。

source: Automate
ja: 自動化
pt: Automatizar

source: Automate anything with
ja: で何かを自動化する
pt: Automatize qualquer coisa com

source: Available for iOS and Android
ja: iOSとアンドロイドで利用可能
pt: Disponível para iOS e Android

source: Available for macOS, Windows, and Linux
ja: macOS、ウィンドウ、および Linux で使用可能
pt: Disponível para macOS, Windows e Linux

source: Better code starts with pull requests
ja: より良いコードはプル要求から始まります
pt: Código melhor começa com pull requests

source: Blog
ja: ブログ

source: Build like the best with GitHub Enterprise
ja: GitHubエンタープライズで最高のように構築
pt: Desenvolva como os melhores, com GitHub Enterprise

source: Build on what's been built
ja: ビルドされたものの上に構築
pt: Construa com base no que já foi construído

source: By submitting this form, I agree to be contacted by GitHub Sales.
ja: このフォームを送信することで、GitHub営業から連絡をうけることに同意します。

source: Careers
ja: キャリア
pt: Carreiras

source: Choose a country
ja: 国を選択する

source: Choose a state
ja: 状態を選択する

source: Choose an option
ja: 選択肢から選ぶ

source: Code
ja: コード
pt: Código

source: Code review
ja: コード レビュー
pt: Revisão de código

source: Code review is built in.
ja: コード レビューが組み込まれています。
pt: A revisão do código está incorporada.

source: CodeQL’s code scanning automatically reviews every change to your codebase and identifies known vulnerabilities before they ever reach production.
ja: CodeQL のコード スキャンでは、コードベースに対するすべての変更が自動的に確認され、既知の脆弱性が実稼働状態になる前に特定されます。
pt: A varredura de código do CodeQL revisa automaticamente cada alteração no seu código e identifica vulnerabilidades conhecidas antes que elas sejam lançadas.

source: Codespaces
ja: コードスペース

source: Codespaces brings the world’s most popular desktop editor to every repo. Code, build, test, use the terminal, and open pull requests from anywhere.
ja: コードスペースは、世界で最も人気のあるデスクトップエディタをあらゆるレポにもたらします。コード、ビルド、テスト、ターミナルの使用、およびどこからでもプル要求を開きます。
pt: Codespaces traz o editor desktop mais popular do mundo para todos os repositórios. Escreva código, compile, teste, use o terminal e abra pull requests de qualquer lugar.

source: Codespaces gives you a complete, configurable dev environment on top of a powerful VM in minutes.
ja: コードスペースは、数分で強力な VM の上に完全で構成可能な開発環境を提供します。
pt: Os Codespaces lhe dão um ambiente completo e configurável em cima de um VM poderoso em minutos.

source: Collaborate
ja: 協力する
pt: Colaboração

source: Collections
ja: コレクション
pt: Coleções

source: Community
ja: コミュニティ
pt: Comunidade

source: Community Forum
ja: コミュニティフォーラム
pt: Fórum da Comunidade

source: Community forum
ja: コミュニティフォーラム
pt: Fórum da comunidade

source: Company
ja: 会社
pt: Empresa

source: Compare plans
ja: プランの比較
pt: Compare planos

source: Connect with others
ja: 他のユーザーとつながる
pt: Conecte-se com outros

source: Contact Enterprise support.
ja: Enterprise supportにお問い合わせください。フォームは英語ですが、日本語でもお問い合わせ可能です。

source: Contact Sales
ja: 送信
pt: Contatar Vendas

source: Country
ja: 国

source: Create a new organization for free
ja: 新しい組織を無料で作成する
pt: Crie uma nova organização gratuitamente

source: Created index.js
ja: 作成されたインデックス.js
pt: Criado o index.js

source: Customer Support for GitHub Enterprise
ja: GitHub Enterpriseのカスタマーサポート

source: Customer stories
ja: お客様のストーリー
pt: Histórias de clientes

source: Customize to your heart’s desire.
ja: あなたの心の欲望に合わせてカスタマイズします。
pt: Personalize como o seu coração mandar.

source: Dependabot keeps your projects up to date
ja: ディペンダボットは、あなたのプロジェクトを最新の状態に保ちます
pt: O Dependabot mantém seus projetos atualizados

source: Develop
ja: 開ける
pt: Desenvolvimento

source: Developer API
ja: 開発者 API
pt: API de desenvolvimento

source: Developers
ja: 開発者
pt: Desenvolvedores

source: Docs
ja: ドキュメント
pt: Documentação

source: Education
ja: 教育
pt: Educação

source: Email address
ja: アドレス
pt: Endereço de e-mail

source: Evaluate or add users to GitHub Enterprise
ja: GitHub Enterpriseについての問合せ

source: Events
ja: イベント
pt: Eventos

source: Explore
ja: Explorer
pt: Explorar

source: Explore GitHub
ja: GitHub を探索する
pt: Explorar o GitHub

source: Explore the Actions Marketplace
ja: アクションマーケットプレイスの詳細
pt: Explore o Marketplace de Actions

source: Features
ja: 機能
pt: Funcionalidades

source: Fill out a general support request.
ja: こちらのフォームから行ってください。

source: Find and fix vulnerabilities
ja: 脆弱性の検出と修正
pt: Encontre e corrija vulnerabilidades

source: Find the best community-approved projects to accelerate your work, then share it with the world with %{npm} and GitHub Packages.
ja: あなたの仕事を加速するための最高のコミュニティ承認プロジェクトを見つけ、 %{npm} とGitHubパッケージで世界と共有してください。
pt: Encontre os melhores projetos aprovados pela comunidade para acelerar seu trabalho e compartilhe-o com o mundo com %{npm} e GitHub Packages.

source: Fortune 100
ja: フォーチュン 100

source: Found a vulnerability?
ja: 脆弱性が見つかりましたか?
pt: Encontrou uma vulnerabilidade?

source: Get paid for building what matters to you with GitHub Sponsors.
ja: GitHubスポンサーとあなたに重要なものを構築するための報酬を得る。
pt: Seja pago para construir o que importa para você com GitHub Sponsors.

source: GitHub CLI is available on macOS, Windows, and Linux
ja: GitHub CLI は、macOS、ウィンドウ、および Linux で使用できます。
pt: GitHub CLI está disponível no macOS, Windows e Linux

source: GitHub Desktop is available on macOS and Windows
ja: GitHubデスクトップは、macOSとウィンドウで利用可能です
pt: GitHub Desktop está disponível no macOS e Windows

source: GitHub Discussions is dedicated space for your community to come together, ask and answer questions, and have open-ended conversations.
ja: GitHub ディスカッションは、コミュニティが集まり、質問をして回答し、オープンエンドの会話を行うための専用スペースです。
pt: O GitHub Discussions é um espaço dedicado para que sua comunidade se reúna, faça e responda perguntas, e tenha conversas abertas.

source: GitHub Stars program
ja: ギットハブスターズプログラム

source: GitHub mailing address
ja: GitHub本社住所

source: GitHub: Where the world builds software
ja: GitHub: 世界がソフトウェアを構築する場所
pt: GitHub: Onde o mundo constrói software

source: Give your code a home in the cloud
ja: コードをクラウドにホームにする
pt: Dê ao seu código uma casa na nuvem

source: Host it all for free with unlimited public and private repositories.
ja: 無制限のパブリックリポジトリとプライベートリポジトリで無料ですべてをホストします。
pt: Hospede tudo gratuitamente com repositórios públicos e privados ilimitados.

source: I need help with...
ja: お問合せ内容

source: If you change your mind, you can %{unsubscribe_link} at any time.
ja: いつでも %{unsubscribe_link} できます。

source: Blazing fast cloud developer environments with
ja: インスタント開発環境
pt: Ambientes de desenvolvimento instantâneos com

source: Integrations
ja: 統合
pt: Integrações

source: Issues
ja: 問題

source: Keep work moving.
ja: 仕事を動かし続ける。
pt: Mantenha o trabalho em movimento.

source: Keep your secrets.
ja: あなたの秘密を守る。
pt: Guarde seus segredos.

source: Kick off automated workflows with GitHub events like push, issue creation, merge, and release.
ja: プッシュ、問題の作成、マージ、リリースなどの GitHub イベントを使用して自動化されたワークフローを開始します。
pt: Inicie fluxos de trabalho automatizados com eventos do GitHub, como push, criação de issues, merge e lançamento.

source: Know when your pull request is ready to merge when everything’s green.
ja: プルリクエストが統合の準備ができたときに、すべてが緑色のときに知ることができます。
pt: Saiba quando o seu pull request está pronto para o merge quando tudo estiver verde.

source: Learn about GitHub Advanced Security or new products
ja: GitHub Advanced Securityやその他新サービスについての問合せ

source: Learn and contribute
ja: 学び、貢献する
pt: Aprenda e contribua

source: Learn how to get started with Discussions
ja: ディスカッションの開始方法の詳細
pt: Aprenda como usar Discussions

source: Learn more about Dependabot
ja: ディペンダボットの詳細
pt: Saiba mais sobre o Dependabot

source: Learn more about GitHub Actions
ja: GitHub アクションの詳細
pt: Saiba mais sobre o GitHub Actions

source: Learn more about GitHub Codespaces
ja: GitHub コードスペースの詳細
pt: Saiba mais sobre o GitHub Codespaces

source: Learn more about Sponsors
ja: スポンサーの詳細
pt: Saiba mais sobre Sponsors

source: Learn more about advanced security
ja: 高度なセキュリティの詳細
pt: Saiba mais sobre segurança avançada

source: Make your contribution
ja: あなたの貢献をする
pt: Faça sua contribuição

source: Millions of developers and companies build, ship, and maintain their software on GitHub—the largest and most advanced development platform in the world.
ja: 世界最大かつ最先端の開発プラットフォームであるGitHubで、何百万もの開発者や企業がソフトウェアを構築、出荷、保守しています。
pt: Milhões de desenvolvedores e empresas constroem, enviam e mantêm seu software no GitHub — a maior e mais avançada plataforma de desenvolvimento do mundo.

source: Mobile
ja: モビール
pt: Móvel

source: Name
ja: 氏名

source: Need customer support?
ja: 既に当社製品をお使いのお客様へ

source: Open source guides
ja: オープンソースガイド
pt: Guias de código aberto

source: Organizations
ja: Organization
pt: Organizações

source: Other
ja: その他

source: Our security advisory remediation tools help developers identify and disclose them responsibly so maintainers can patch them in dedicated, private workspaces.
ja: 当社のセキュリティ アドバイザリ修復ツールは、開発者が責任を持って特定して開示できるようになったので、メンテナンス担当者は専用のプライベート ワークスペースで修正プログラムを適用できます。
pt: Nossas ferramentas de remediação de avisos de segurança ajudam quem desenvolve a identificá-los e expô-los de forma responsável. Assim, pessoas que mantém o código podem corrigí-los em workspaces privados e dedicados.

source: Packages
ja: パッケージ
pt: Pacotes

source: Partners
ja: パートナー
pt: Parceiros

source: Phone Number
ja: 電話番号

source: Phone number
ja: 電話番号

source: Plans
ja: 計画
pt: Planos

source: Platform
ja: プラットフォーム
pt: Plataforma

source: Press
ja: プレス
pt: Imprensa

source: Pricing
ja: 価格
pt: Preços

source: Privacy
ja: プライバシー
pt: Privacidade

source: Product
ja: 製品
pt: Produto

source: Professional Services
ja: プロフェッショナルサービス
pt: Serviços Profissionais

source: Project management
ja: プロジェクトマネジメント
pt: Gerenciamento de projetos

source: Pull requests cover the entire review flow: propose changes, browse code, ask for input, make a suggestion, and sign off in one place.
ja: プル要求は、変更の提案、コードの参照、入力の要求、提案、および 1 か所でサインオフというレビュー フロー全体をカバーします。
pt: Os pull requests cobrem todo o fluxo de revisão: propor alterações, procurar código, pedir opiniões, fazer sugestões e aprovações em um só lugar.

source: Put a GUI on it with %{github_desktop} or stay in the command line with %{github_cli}.
ja: gui を %{github_desktop} で配置するか、 %{github_cli}と一緒にコマンドラインにとどまる。
pt: Use uma interface gráfica com o %{github_desktop} ou continue na linha de comando com o %{github_cli}.

source: Questions about your existing GitHub Enterprise Installation?
ja: GitHub Enterpriseに関する質問や技術サポートのお問合せ

source: Ready player two.
ja: 準備ができてプレーヤー2。
pt: Jogador dois pronto.

source: Record or rewind any change to your code to keep you and your team in sync.
ja: コードの変更を記録または巻き戻して、チームとの同期を維持します。
pt: Faça ou desfaça qualquer alteração no seu código para manter você e sua equipe em sincronia.

source: Repositories
ja: リポジトリ
pt: Repositórios

source: Resources
ja: リソース
pt: Recursos

source: Review or merge code, manage notifications, browse repositories, and more with %{github_for_mobile}.
ja: %{github_for_mobile}を使用して、コードのレビューまたはマージ、通知の管理、リポジトリの参照などを行います。
pt: Revise ou faça merge do código, gerencie notificações, navegue em repositórios e muito mais com %{github_for_mobile}.

source: Reviews approved? Check. Tests passing? Check check. No conflicts? Ship it already.
ja: 承認されたレビュー?小切手。テストが合格しましたか?チェックを確認します。競合はありませんか?すでにそれを出荷します。
pt: Revisões aprovadas? Confirma. Os testes estão passando? Confirma. Sem conflitos? Coloque no ar agora mesmo.

source: Roadmap
ja: ロードマップ

source: Run actions in any language or operating system, on Linux, macOS, Windows, ARM, and containers. Or all at once with matrix builds.
ja: Linux、macOS、Windows、ARM、およびコンテナ上の任意の言語またはオペレーティングシステムでアクションを実行します。または、マトリックスビルドを使用して一度にすべて。
pt: Rode ações em qualquer linguagem ou sistema operacional, no Linux, macOS, Windows, ARM e contêineres. Ou tudo de uma vez com builds matriciais.

source: Scale your team to any size in the cloud.
ja: クラウド内の任意のサイズにチームを拡大します。
pt: Dimensione sua equipe para qualquer tamanho na nuvem.

source: Secure
ja: 牢
pt: Segurança

source: Secure your code as you write it.
ja: コードを記述するときに、コードをセキュリティで保護します。
pt: Proteja seu código enquanto o escreve.

source: Security
ja: セキュリティ
pt: Segurança

source: Setup CI/CD, enhance your DevOps, and script your entire workflow with GitHub Actions.
ja: CI/CD をセットアップし、DevOps を強化し、GitHub アクションを使用してワークフロー全体をスクリプト化します。
pt: Configure CI/CD, melhore seu DevOps e crie scripts de todo o seu fluxo de trabalho com o GitHub Actions.

source: Shop
ja: ショップ
pt: Loja

source: Sign in
ja: サインイン
pt: Entrar

source: Sign up
ja: サインアップ
pt: Criar uma conta

source: Sign up for GitHub
ja: GitHub にサインアップする
pt: Crie uma conta no GitHub

source: Site Map
ja: サイトマップ
pt: Mapa do site

source: Small experiments, inspired inventions, and the software everyone depends on—the code you write on GitHub can reach one codebase or millions.
ja: 小さな実験、インスピレーションを受けた発明、そして誰もが依存しているソフトウェア—GitHubで記述するコードは、1つのコードベースまたは数百万に達することができます。
pt: Pequenos experimentos, invenções inspiradas e o software do qual todos dependem — o código que você escreve no GitHub pode atingir uma base de código ou milhões.

source: Social Impact
ja: 社会的インパクト
pt: Impacto Social

source: Speaking of automation,
ja: 自動化といえば、
pt: Falando em automação,

source: State
ja: 状態

source: Status
ja: 状況

source: Support
ja: サポート
pt: Suporte

source: Support Octocats shared on Twitter
ja: ツイッターで共有されたオクトキャットのサポート
pt: Suporte ao compartilhamento de Octocats no Twitter

source: Support the projects you depend on, too.
ja: 依存するプロジェクトもサポートします。
pt: Apoie os projetos de que você também depende.

source: Take collaboration to the next level with security and administrative features built for teams.
ja: チーム向けに構築されたセキュリティと管理機能を備えたコラボレーションを次のレベルに引き上げます。
pt: Leve a colaboração para o próximo nível com recursos de segurança e administrativos construídos para equipes.

source: Talk to our sales team
ja: GitHub Enterprise製品に関するお問合せ

source: Tell the story of your work through your repositories, contributions, and technologies of choice.
ja: リポジトリ、貢献、選択したテクノロジーを通じて、作業のストーリーを伝えます。

source: Tell us more about your questions, needs, and timeline.
ja: 質問内容やスケジュール感などについて記載してください。

source: Terms
ja: 規約
pt: Termos

source: That open source code you wrote for yourself might just help someone else.
ja: 自分で書いたオープンソースコードは、他の人を助けるかもしれません。
pt: Aquele código-fonte aberto que você escreveu para si mesmo pode ajudar outra pessoa.

source: The ReadME Project
ja: ReadME プロジェクト
pt: O Projeto ReadME

source: The future of code is in the cloud, not your local copy.
ja: コードの未来は、ローカルコピーではなくクラウドにあります。
pt: O futuro do código está na nuvem, não na sua cópia local.

source: The home for all developers — including you
ja: すべての開発者のための家 - あなたを含む
pt: A casa para todos os desenvolvedores — incluindo você

source: Trending
ja: トレンド
pt: Tendências

source: Verify you're not a robot...
ja: ボットではないことを証明してください

source: Visual Studio Code, in your browser, full stop.
ja: Visual Studio コード、ブラウザーで、完全に停止します。
pt: Visual Studio Code, no seu navegador, ponto final.

source: We automatically scan repositories for OAuth tokens, API keys, personal tokens, and more. If we find one, we’ll notify you and the partner that issued it to invalidate the secret.
ja: OAuth トークン、API キー、個人用トークンなどのリポジトリを自動的にスキャンします。見つけた場合は、シークレットを無効にするために、お客様とそれを発行したパートナーに通知します。
pt: Nós escaneamos automaticamente repositórios de tokens OAuth, chaves de API, tokens pessoais e muito mais. Se encontrarmos um, notificaremos você e o parceiro que o emitiu para invalidar o segredo.

source: What is Git?
ja: Gitとは何ですか?
pt: O que é Git?

source: Where the world builds software
ja: 世界がソフトウェアを構築する場所
pt: Onde o mundo constrói software

source: Why GitHub?
ja: なぜGitHub?
pt: Por que o GitHub?

source: With 70 million jobs run per month you’re in good company with Actions, the number one CI service on the world’s largest developer platform.
ja: 月に7,000万人のジョブが実行される場合、世界最大の開発者プラットフォームでナンバーワンのCIサービスであるアクションと良好な関係にあります。
pt: Com 70 milhões de jobs executados por mês, você está em boa companhia com Actions, o serviço de CI número um na maior plataforma de desenvolvedores do mundo.

source: Work Email
ja: メール

source: Work however you want.
ja: あなたが望むように働く。
pt: Trabalhe como quiser.

source: Write less code thanks to the world's largest software package registry.
ja: 世界最大のソフトウェア パッケージ レジストリのおかげで、コードを少なくします。
pt: Escreva menos código graças ao maior registro de pacotes de software do mundo.

source: Write your own, or import Actions from the open source community, all within our world-class editor. Feeling stuck? Browse the Actions developer docs as you code.
ja: 独自のアクションを作成するか、オープンソースコミュニティからアクションをインポートして、すべてワールドクラスのエディタ内で行います。立ち往生を感じますか?コードを記述する際に、アクション開発者ドキュメントを参照します。
pt: Escreva suas próprias Actions, ou importe da comunidade de código aberto, tudo a partir do nosso editor, que está entre os melhores do mundo. Está com um bloqueio? Navegue pela documentação para desenvolvimento de Actions enquanto programa.

source: Yes, I would like to be emailed with the latest news and happenings, products, and special offers from GitHub.
ja: GitHub製品に関する最新情報をメールで受け取る。

source: You can have it all.
ja: あなたはそれをすべて持つことができます。
pt: Você pode ter tudo.

source: added some commits 8 minutes ago
ja: 8 分前にいくつかのコミットを追加しました
pt: acrescentou alguns commits 8 minutos atrás

source: before you merge
ja: マージする前に
pt: antes de fazer merge

source: million
ja: 百万
pt: milhões

source: unsubscribe
ja: 配信停止

source: with automated pull requests that update all your dependencies. Just review and merge to keep your software secure.
ja: すべての依存関係を更新する自動プル要求を使用します。ソフトウェアを安全に保つために、レビューとマージを行うだけです。
pt: com pull requests automatizadas que atualizam todas as suas dependências. Basta revisar e fazer merge para manter seu software seguro.

source: —conversations around your code where you can experiment, squash bugs, and build new features.
ja: —コードを中心にして、バグをテストしたり、バグを押しつぶしたり、新しい機能を構築したりできます。
pt: — conversas em torno do seu código onde você pode experimentar, consertar bugs e construir novas funcionalidades.

source: GitHub for mobile
pt: GitHub para dispositivos móveis

source: Team
pt: Equipe

source: Topics
pt: Tópicos
