{
  "student_pages": {
    "type": "banner",
    "label": "Student pages",
    "purpose": "For use on projects hosting Pages sites that are clones of popular websites, companies, or brands created in direct connection to a student assignment or exercise.",
    "title": "This page was made as a personal project in connection with an educational exercise.",
    "subtitle": "This is NOT the official site of the company or brand identified on the page. The creator of this page is NOT affiliated with the company or brand in any way. DO NOT enter any personal information (such as logins, passwords or credit card numbers) on this site.",
    "reason": "A personal project made in connection with an education exercise that could create confusion with a well known company or brand."
  },
  "mis_dis_information": {
    "type": "banner",
    "label": "Mis/disinformation",
    "purpose": "For use on projects containing unsubstantiated or controversial information that could have adverse affects on individuals or the public interest if acted upon.",
    "title": "This page may contain false or misleading information.",
    "reason": "Unverified information that could adversely affect individuals or the public interest.",
    "subtitle": "The information contained in this page has not been verified and may include false, inaccurate, fabricated, or otherwise deceptive claims. In particular, it has been determined that this page may contain ",
    "sub_categories": {
      "medical_scientific": {
        "label": "Medical/Scientific",
        "value": "inaccurate or scientifically unsupported medical claims or advice that have not been written by a medical professional and could endanger public health or safety."
      },
      "manipulated_media": {
        "label": "Manipulated Media",
        "value": "manipulated media, whether audio or visual, likely to mislead or deceive in a way that may harm the public interest."
      },
      "civic_activities": {
        "label": "Civic Activities",
        "value": "false or misleading content likely to interfere with an individual's ability to participate in civic activities."
      },
      "hate_harassment": {
        "label": "Hate/Harassment",
        "value": "unsubstantiated claims that could promote hate or targeted harassment of specific groups of people."
      }
    }
  },
  "sexually_explicit_content": {
    "type": "interstitial",
    "label": "Sexually explicit content",
    "purpose": "For use on projects that contain code, text, images, and/or video that is sexually explicit in nature and may not be suited for younger users.",
    "title": "This project may contain sexually explicit content suited only for mature audiences.",
    "reason": "Sexually explicit content suited only for mature audiences."
  },
  "violent_content": {
    "type": "interstitial",
    "label": "Violent content",
    "purpose": "For use on projects that contain content with violent themes, images, and/or video.",
    "title": "This project may contain violent content including disturbing themes, images, and/or video.",
    "reason": "Violent content including disturbing themes, images, and/or video."
  },
  "objectionable_offensive_content": {
    "type": "interstitial",
    "label": "Objectionable/offensive content",
    "purpose": "For use on projects that contain content that is potentially objectionable or offensive and may trigger negative or unsafe feelings among certain audiences.",
    "title": "This project may contain offensive or objectionable content that some audiences may find difficult.",
    "reason": "Offensive or objectionable content that some audiences may find difficult."
  },
  "malicious_content": {
    "type": "interstitial",
    "label": "Malicious content",
    "purpose": "For use on repositories that contain malicious content that may cause technical harms but that we choose to preserve for security research purposes.",
    "title": "This repository contains malicious content that may cause technical harms. We have decided to preserve this content for security research purposes. Please exercise CAUTION when clicking links, downloading releases, or otherwise interacting with this repository.",
    "reason": "Malicious content that may cause technical harms."
  }
}
