{
  "USER_REPORT": {
    "type": "dsa_source",
    "email_partial": "we received a report"
  },
  "DSA_REPORT": {
    "type": "dsa_source",
    "email_partial": "we received a notice pursuant to Article 16 of the DSA"
  },
  "SCAN_DETECTION": {
    "type": "dsa_source",
    "email_partial": "we received a notification from our automated scanning systems"
  },
  "STAFF_DETECTION": {
    "type": "dsa_source",
    "email_partial": "we noticed your account through voluntary investigations of our own initiative"
  },
  "CSAM": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting sexually obscene content. We do not tolerate content associated with sexual exploitation or abuse of another individual, including where minors are concerned."
  },
  "VIOLENT_CONTENT": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting threats of violence and gratuitously violent content. You may not use GitHub to organize, promote, encourage, threaten, or incite acts of violence. You may not post content that depicts or glorifies violence or physical harm against human beings or animals."
  },
  "DISCRIMINATORY_CONTENT": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting hate speech and discrimination. We do not tolerate speech that attacks or promotes hate toward an individual or group of people on the basis of who they are, including age, body size, ability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, sexual identity, or sexual orientation."
  },
  "USER_CARE": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting threats of violence and gratuitously violent content. You may not post content that depicts or glorifies violence or physical harm against human beings or animals. This includes posting text, imagery, or audio content glorifying or containing a graphic depiction of violence toward oneself, another individual, group, or animal, or encouraging another individual to engage in self harm."
  },
  "TVEC": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting displaying clear affiliation or identification with known terrorist or violent extremist organizations. We do not tolerate speech that attacks or promotes hate toward an individual or group of people on the basis of who they are, including age, body size, ability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, sexual identity, or sexual orientation."
  },
  "VIOLENCE": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting threats of violence and gratuitously violent content. You may not use GitHub to organize, promote, encourage, threaten, or incite acts of violence. You may not post content that depicts or glorifies violence or physical harm against human beings or animals."
  },
  "TOS_VIOLENCE": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting threats of violence and gratuitously violent content. You may not use GitHub to organize, promote, encourage, threaten, or incite acts of violence. You may not post content that depicts or glorifies violence or physical harm against human beings or animals."
  },
  "SEXUALLY_OBSCENE_CONTENT": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting sexually obscene content. We do not allow sexually themed or suggestive content that serves little or no purpose other than to solicit an erotic or shocking response, particularly where that content is amplified by its placement in profiles or other social contexts."
  },
  "SPAM": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting spam and inauthentic activity. We do not allow content or activity on GitHub that is: automated excessive bulk activity and coordinated inauthentic activity, such as spamming and cryptocurrency mining; bulk distribution of promotions and advertising prohibited by GitHub terms and policies; inauthentic interactions, such as fake accounts and automated inauthentic activity; rank abuse, such as automated starring or following; creation of or participation in secondary markets for the purpose of the proliferation of inauthentic activity; using GitHub as a platform for propagating abuse on other platforms; phishing or attempted phishing; or using our servers for any form of excessive automated bulk activity, to place undue burden on our servers through automated means, or to relay any form of unsolicited advertising or solicitation through our servers, such as get-rich-quick schemes; incentivized by (or incentivizes inauthentic engagement with) rewards such as cryptocurrency airdrops, tokens, credits, gifts or other give-aways."
  },
  "DISRUPTIVE_CONTENT": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting behavior that significantly or continually disrupts the experience of other users. We do not allow behavior that significantly or continually disrupts the experience of other users. This includes: posting off-topic comments; opening empty or meaningless issues or pull requests; starring and/or following accounts or repositories in large volume in a short period of time; creating nonsensical or irrelevant code reviews; engaging with platform features in a way that causes excessive notifications for other users; and using any other platform feature in a way that creates disruption."
  },
  "MALWARE": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting the use of our platform in direct support of unlawful attacks that cause technical harms. We do not allow anyone to use our platform in direct support of unlawful attacks that cause technical harms, such as using GitHub as a means to deliver malicious executables or as attack infrastructure, for example by organizing denial of service attacks or managing command and control servers. Technical harms means overconsumption of resources, physical damage, downtime, denial of service, or data loss, with no implicit or explicit dual-use purpose prior to the abuse occurring."
  },
  "PHISHING": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting spam and inauthentic activity. We do not allow content or activity on GitHub that is: automated excessive bulk activity and coordinated inauthentic activity, such as spamming and cryptocurrency mining; bulk distribution of promotions and advertising prohibited by GitHub terms and policies; inauthentic interactions, such as fake accounts and automated inauthentic activity; rank abuse, such as automated starring or following; creation of or participation in secondary markets for the purpose of the proliferation of inauthentic activity; using GitHub as a platform for propagating abuse on other platforms; phishing or attempted phishing; or using our servers for any form of excessive automated bulk activity, to place undue burden on our servers through automated means, or to relay any form of unsolicited advertising or solicitation through our servers, such as get-rich-quick schemes; incentivized by (or incentivizes inauthentic engagement with) rewards such as cryptocurrency airdrops, tokens, credits, gifts or other give-aways."
  },
  "HARASSMENT": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting bullying and harassment. We do not tolerate harassment, bullying, or abuse of any kind, whether directly or by encouraging others to take part in the prohibited conduct. This includes: targeted personal attacks; piling on to or orchestrating disruptive activity in a way that amounts to abuse; following another user around the platform in a manner that causes intimidation; making sexual advances or comments directed at another individual; disingenuously participating in conversation in a way that instigates conflict or undermines sincere discussion; and creating alternative accounts specifically to evade moderation action taken by GitHub staff or users."
  },
  "MISUSE_OF_PII": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting doxxing and invasion of privacy. We do not allow content that invades the privacy of others by posting other people's personal information, including: personal, private email addresses, phone numbers, physical addresses or other private location information, bank account information or credit card numbers, Social Security/National Identity numbers, passwords, voter information, medical information and personal biometric data, and other private information that may pose a safety or security risk."
  },
  "DISINFORMATION": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting misinformation and disinformation. You may not post content that presents a distorted view of reality, whether it is inaccurate or false (misinformation) or is intentionally deceptive (disinformation), where such content is likely to result in harm to the public or to interfere with fair and equal opportunities for all to take part in a free and open society."
  },
  "COPPA": {
    "type": "tos_reason",
    "email_partial": "our Terms of Service requiring users to be age 13 or older. GitHub does not target our Service to children under 13, and we do not permit any Users under 13 on our Service."
  },
  "IMPERSONATION": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting impersonation. You may not misrepresent your identity or your association with another person or organization."
  },
  "TRAFFICKING_NCII_SOLICITATION": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting sexually obscene content. We do not tolerate content associated with sexual exploitation or abuse of another individual, including non-consensual intimate imagery. We do not allow sexually themed or suggestive content that serves little or no purpose other than to solicit an erotic or shocking response, particularly where that content is amplified by its placement in profiles or other social contexts."
  },
  "TRADEMARK": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policy prohibiting infringement of proprietary rights. We do not allow content or activity that infringes any proprietary right of any party, including patent, trademark, trade secret, copyright, right of publicity, or other right."
  },
  "OTHER": {
    "type": "tos_reason",
    "email_partial": "our Acceptable Use Policies or Terms of Service."
  }
}
